app/controllers/school_classes_controller.rb

    def create
      sc = SchoolClass.create(sc_params)
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]

    def find_sc
      @sc = SchoolClass.find_by(id: params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]